{
  "basics": {
    "name": "Jon Adams",
    "picture": "profile.png",
    "email": "jon@kuokoa.studio",
    "phone": "+1-808-343-7953",
    "website": "http://daetal.us",
    "label": "Industrial Developer",
    "summary": "Experienced, passionate, resourceful and effective developer, designer and architect of web applications and microservices, distributed systems, dynamic data processing, analysis and interactive visualization.",
    "location": {
      "address": "111 Hekili Street, Suite A498",
      "postalCode": "96734",
      "city": "Kailua",
      "country": "US",
      "region": "Hawaiʻi"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "daetal-us",
        "url": "https://github.com/daetal-us"
      },{
        "network": "Medium",
        "username": "daetalus",
        "url": "http://medium.com/@daetalus"
      },{
        "network": "Twitter",
        "username": "daetalus",
        "url": "http://twitter.com/@daetalus"
      },{
        "network": "LinkedIn",
        "username": "daetalus",
        "url": "https://linkedin.com/in/daetalus"
      }
    ]
  },
  "work": [
    {
      "name": "Kuokoa, LLC",
      "location": "Oʻahu, HI",
      "position": "Owner",
      "startDate": "2016-10",
      "endDate": "Current",
      "summary": "",
      "highlights": [
        "Designed, developed, deployed and iterated on numerous public and private web applications for various Fortune 100 companies and other clients.",
        "Designed, developed and launched a general purpose iOS App with companion Apple Watch App utilizing location and device orientation to measure current three-dimensional positions and compute differences from other three-dimensional positions.",
        "Designed all content and layout, captured and edited all photography, coordinated printing, publishing and sales for a casual but elegant and inspiring culinary catalog; complemented by a website and paired with open source tooling."
      ],
      "details": [
        "Designed, developed, deployed and iterated on numerous public and private web applications for various Fortune 100 companies and other clients with equally varied technical solutions and tooling including containerized microservices, both custom and open source, interfacing with various internal and external APIs; implementing authentication, authorization schemes, payment processing, custom log pipelines, transactional and email notifications, stylized mapping, collaborative and dynamic interfaces, templatized pdf generation, and more with tools like shell scripts, Makefiles, golang, JSON, javascript, node.js, Typescript, php, Postgres, BoltDB, MySQL, nginx, docker, terraform and frameworks like React, Vue.js, Echo to name a few.",
        "Designed, developed and launched <a href=\"https://itunes.apple.com/us/app/pikō/id1348172249\">Pikō</a>: a general purpose iOS App with companion Apple Watch application utilizing location and device orientation to measure current three-dimensional positions and compute differences from other three-dimensional positions as various nautical, aeronautical and other mathematical representations.",
        "Designed all content and layout in Adobe InDesign, captured and edited all photography, coordinated printing, publishing and sales at <a href=\"https://kuokoa.life\">kuokoa.life</a> for <a href=\"https://kuokoa.life/products/food-vibes\">Food Vibes</a>: a casual but elegant and inspiring culinary catalog complemented by <a href=\"http://foodvib.es\">foodvib.es</a>, a custom-rolled static HTML/CSS website and original <a href=\"https://github.com/foodvibes\">open source tooling</a> created to manage and publish the site."
      ]
    },
    {
      "name": "Apple, Inc.",
      "location": "Cupertino, CA",
      "position": "Data Visualist, Industrial Design",
      "startDate": "2015-06",
      "endDate": "2016-10",
      "summary": "Directly supported Industrial Design with emphasis on Human Factors. Collaborated with Designers, Researchers and Engineering teams across every function of the company to collectively and iteratively explore, identify and optimize both physical and virtual product design and design processes.",
      "highlights": [
        "Produced compelling interactive and static visual design communications and statistical analysis summaries utilized by the Industrial and Product Design teams and directly influencing the design process and conversation for multiple successful and in-development products.",
        "Generated numerous three dimensional surfaces, curvature and other geometries directly supporting various products ranging from physical and virtual product features to abstract, statistical representations of various aspects of the human form in dynamic contexts.",
        "Architected and successfully coordinated development of a sophisticated document-oriented data structure, HTTP JSON API and internal security strategy for a standardized data warehouse and unified reporting interface for disparate experimental data.",
        "Designed a novel, configurable, iterative shape-fitting process that served at the center of design process for a product that was considered and queued for U.S. Patent."
      ],
      "details": [
        "Produced compelling interactive and static visual design communications and statistical analysis summaries using MATLAB, RStudio, Swift, Golang and Node.js parsing CSV, JSON and other data streams; in the web context, heavily leveraged D3 and Three.js libraries and custom-built extensions thereof for visualization and interaction; utilized by the Industrial and Product Design teams and directly influencing the design process and conversation for multiple successful and in-development products.",
        "Generated numerous three dimensional surfaces, curvature and other geometries directly supporting various products ranging from physical and virtual product features to abstract, statistical representations of various aspects of the human form in dynamic contexts.",
        "Architected and successfully coordinated development of a sophisticated document-oriented data structure, HTTP JSON API and internal security strategy for a standardized data warehouse and unified reporting interface for disparate experimental data.",
        "Designed a novel, configurable, iterative shape-fitting process leveraging PolyWorks by 3D Infotech and custom generated models in STL, point cloud and CSV formats that served at the center of design process for a product that was considered and queued for U.S. Patent."
      ]
    }, {
      "name": "Apple, Inc.",
      "location": "Cupertino, CA",
      "position": "Interactive Data Engineer, Product Design",
      "startDate": "2015-02",
      "endDate": "2015-06",
      "summary": "Directly supported Industrial Design with emphasis on Human Factors. Collaborated with Designers, Researchers and Engineering teams across every function of the company to collectively and iteratively explore, identify and optimize both physical and virtual product design and design processes.",
      "highlights": [
        "Developed and deployed in-house wiki and publishing platform to coordinate communication, transparency and collaboration of Human Factors related research and interactive data visualizations.",
        "Level of success, impact and utility in development, design, collaboration and communication warranted induction to Industrial Design team in an official capacity within three months."
      ],
      "details": [
        "Developed and deployed in-house wiki and publishing platform leveraging Markdown and Javascript to coordinate communication, transparency and collaboration of Human Factors related research and interactive data visualizations.",
        "Level of success, impact and utility in development, design, collaboration and communication with data processing and interactive visualizations using Golang, Node.js, Three.js and D3 and evolving wiki warranted induction to Industrial Design team in an official capacity within three months."
      ]
    }, {
      "name": "Apple, Inc.",
      "location": "Cupertino, CA and Shanghai, China",
      "position": "Producer, Manufacturing Design",
      "startDate": "2011-01",
      "endDate": "2015-02",
      "summary": "Founding member and lead developer, designer and architect for a software team embedded in Manufacturing Design.",
      "highlights": [
        "Established and grew a multi-talented software team directly supporting Manufacturing Design in addition to leading the technical architecture, design and development of a suite of web applications and distributed systems supporting the mass production of nearly every product.",
        "Architected, developed and deployed a state-of-the-art authentication micro-service interfacing with the corporate single-sign-on implementation that became an internal gold standard.",
        "Designed, developed and successfully deployed a scalable, distributed manufacturing traceability and quality control system interfacing with laser etch machines, part scanners, custom touch screens with fully customizable data collection collaboratively defined by and utilized by Apple and external suppliers in Asia including a realtime dashboard and reporting system.",
        "Lead the design, codification and adoption of the standard for a distributed, machine-readable, binary part marking and identication standard that was adopted for all desktop and portable enclosures at all suppliers and considered for U.S. Patent.",
        "Founded and coordinated a successful internal open source software initiative and club encouraging collaboration, communication and transparency including branding, a mailing list, chat room with logs and a network of web applications and tooling for code-sharing."
      ],
      "details": [
        "Established and grew a multi-talented software team of backend and frontend web developers, systems administors and architects, mobile developers and devops engineers directly supporting Manufacturing Design in addition to leading the technical architecture, design and development of a suite of web applications and distributed systems supporting the mass production of nearly every product.",
        "Architected, developed and deployed a state-of-the-art reverse proxy authentication micro-service interfacing with the corporate single-sign-on implementation that was internally-open-sourced and became a gold standard for SSO authentication for internal web services.",
        "Designed, developed and successfully deployed a scalable, distributed manufacturing traceability and quality control system built mostly Golang, Couchbase, Oracle Database and a plethora of bash scripts; interfaced with laser etch machines, industrial 1D and 2D barcode scanners, custom touch screens with fully customizable data collection collaboratively defined by and utilized by Apple and external suppliers in Asia including a near-realtime web-accessible dashboard and unified reporting system built with Ember.js and D3.",
        "Lead the design, codification and adoption of the standard for a distributed, machine-readable, binary part marking and identication standard that was adopted for all desktop and portable enclosures at all suppliers and considered for U.S. Patent.",
        "Founded and coordinated a successful internal open source software initiative and club encouraging collaboration, communication and transparency including branding, a mailing list, chat room with logs and a network of web applications and tooling for code-sharing."
      ]
    }, {
      "name": "Iluminada Design",
      "location": "Santa Cruz, CA",
      "position": "Web Developer and Designer",
      "startDate": "2006-02",
      "endDate": "2011-01",
      "summary": "Lead full-stack developement of web applications, customized e-commerce solutions and assisted with occasional interface design.",
      "highlights": [
        "Successfully developed and deployed extraordinary custom modifications and various plugins for existing e-commerce applications and content management systems.",
        "Designed and developed a simple but highly effective an in-house, customizable content management system.",
        "Lead the design and implementation of web-based public resources for an open source, rapid-application-development framework."
      ],
      "details": [
        "Successfully developed and deployed extraordinary custom modifications and various plugins for existing e-commerce applications such as Magento and OSCommerce and content management systems such as Wordpress and Drupal.",
        "Designed and developed a simple but highly effective an in-house, customizable content management system written in CakePHP utilizing MySQL as a database.",
        "Lead the design and HTML/CSS implementation web-based public resources, application scaffolding and included testing suite as well as contributions to the official drivers for CouchDB and MongoDB, in an offical Core Contributor capacity for the open source, rapid-application-development PHP framework Lithium."
      ]
    }
  ]
}
